trade_exp/src/Documents/РейсОтПоставщика/РейсОтПоставщика.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>РейсОтПоставщика</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="6192808a-b721-4de3-b780-6e7774c15660">
    <name>ДатаПрибытияНаСклад</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="2560f69a-852a-4432-a6b7-10f619375949">
    <name>Водитель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="8aea8d4d-49ab-4603-a033-8198176aedbc">
    <name>Автомобиль</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="c881cda6-9885-4140-a866-ce368a8dbe45">
    <name>ПеревозчикПартнер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="f8b685d4-516e-4bef-a5c2-603ab57f9b57">
    <name>Автор</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="b0ddded1-7e7f-49ae-803d-8802383a362a">
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="4b623269-6e37-4b95-98ee-266b68b43837">
    <name>Перевозчик</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="b56b04e8-b732-4c46-a53c-a2198118ebb7">
    <name>Вес</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="209d975d-4310-42b6-971f-978e98a9745f">
    <name>Объем</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="6620929a-a274-4407-9742-e5f9a4823c7b">
    <name>Статус</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="73460591-5ca1-4efb-8d2a-b493c31e8286">
    <name>СтоимостьТовара</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="ad834a54-5628-434f-9e2f-12d4b691e5d6">
    <name>МаксимальнаяДлина</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="1dc74592-a5fe-446f-8bc1-f667a6541130">
    <name>КоличествоМест</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="24d0f865-8755-43f7-b433-eb4f26c19c07">
    <name>СчетНаОплатуПеревозчика</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="163d3cfc-2c30-4f0c-8ce3-b06233a6696b">
    <name>ДатаПодачиНаОплату</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="6de08a23-5870-407d-b993-bdda3659ea54">
    <name>УПДАктОтПеревозчика</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="b2409f2e-9fb9-448b-9415-d6e1536fd98b">
    <name>ФактическаяСтоимостьДоставки</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="ec417d54-2790-4cd3-9254-0ea9a45dec34">
    <name>НачалоВыполнения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="f94659dd-8dc9-42fc-aee6-7b49a000ef74">
    <name>СтавкаНДС</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="5e276869-726d-45c8-85db-39c41bb3fb24">
    <name>ЗаложеноВСтоимость</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="f639e45d-b307-4c2c-8890-fc369b2f01cf">
    <name>ЗаложеноВСтоимостьБезНДС</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="08cdfe8f-7077-4feb-9125-ee010c8832c9">
    <name>ТранзитФизЛицо</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="c50c39f1-1eae-45f8-8af4-df282961236d">
    <name>ПротяженностьРейса</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="c273b851-cfb6-4e19-b450-965896d4e680">
    <name>СтоимостьТранспортнойРаботыПоВесу</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="e90b9be2-980f-447c-b0a4-3dcefb5c2554">
    <name>СтоимостьТранспортнойРаботыПоОбъему</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="e9a071aa-8475-4553-8306-a926414a8f11">
    <name>СостояниеОплатыШапка</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections extendedConfigurationObject="db7fec46-c355-4e4c-834b-1a78e72004ab">
    <name>РасчетДоставки</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="a2e3f808-9f58-492e-9d38-44c0a46b76be">
      <name>ЗаказНаДоставку</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="424af99f-bf5f-4c1b-b109-ca41584d4b5f">
      <name>ДокументОснование</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="89653eca-e88e-4481-8b76-4a411ddfb9e9">
      <name>Вес</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>10</precision>
            <scale>2</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="588cacee-f62f-4f95-8a7d-06bb4cee3139">
      <name>Объем</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>10</precision>
            <scale>2</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="995b91fa-7e9f-4438-a3f0-ec13a55906d6">
      <name>РаспределенныеДеньгиНаДоставку</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>10</precision>
            <scale>2</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="c88530ea-a3b6-4a16-a1df-e1c59b97cd37">
      <name>СтоимостьТовара</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>10</precision>
            <scale>2</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="1586f226-4574-4c20-81e9-b94f5fd931fe">
      <name>НомерДокументаОснования</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>12</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="5a0dc294-e120-49b0-9fb8-cf56243373dd">
      <name>ДоверенностьНаСумму</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="be88e2f0-6a02-4a1d-a78c-00a0fa139df9">
      <name>РасчетнаяРекомендованнаяСтоимость</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>10</precision>
            <scale>2</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="6ed24d8c-4e52-46b4-8fe6-9cb731c4083b">
      <name>ЗаложеноВСтоимость</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>10</precision>
            <scale>2</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="4ddf08a6-b577-4374-b782-c867c06979a6">
      <name>ЗаложеноВСтоимостьБезНДС</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>10</precision>
            <scale>2</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="86a6ba0d-e6c4-41be-8fb3-f8f191db5b98">
      <name>СостояниеОплаты</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="6c9154dc-03f2-4ec2-bcb1-ea8bae214e4c">
      <name>НаличиеАкта</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="cd0b0061-cd53-436a-90f7-18fb2a4261a2">
    <name>ГруппаПоставки</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="c560de4b-7d9d-4f46-82a7-ee306a75ceda">
      <name>Склад</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="ae853f65-af3c-468e-b27e-033d9f1f6662">
      <name>Норматив</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="21c5b145-83dd-4a1e-9f07-265508d78f08">
      <name>Секция</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="49e1cb24-3e6d-4d9b-b4cb-c56dc62c3774">
      <name>ПримечаниеКПоставке</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>150</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="cfa0d9fc-d24d-46d4-a440-130ed16c8eba">
      <name>ДатаРазгрузки</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <dateQualifiers>
            <dateFractions>Date</dateFractions>
          </dateQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="179a339d-ef0a-4bbc-989e-09dddf274afd">
      <name>ВремяПоступления</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <dateQualifiers>
            <dateFractions>Time</dateFractions>
          </dateQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="1f6a7962-d1a4-42a8-87a2-4696ecfb2b94">
      <name>ПродолжительностьРазгрузки</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>10</precision>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="c4a30dc3-d74e-4d5a-a455-d8cba82618d0">
      <name>СогласованоСоСкладом</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="be396fac-1079-4c47-abd1-ec7f2158b5a5">
      <name>ОбъемПоставки</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>10</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="269aa6a1-110a-4164-93ab-6cf713d61d50">
      <name>ВесПоставки</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>10</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="cd005857-e2d5-4b9e-b98a-f98bc4c2c670">
      <name>ФактическоеВремяПрибытия</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="88dd1342-0ced-4f48-a388-bbb4893d7fc1">
      <name>НачалоПогрузкиКПП</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="ae3f0ad3-64cc-44fb-98b5-199a12f9c2a0">
      <name>ОкончаниеПогрузкиКПП</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="2f44c993-6d29-4fd6-8f50-856c8c22fa2e">
      <name>Эстакада</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Document>

trade_exp/src/Documents/РейсОтПоставщика/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область Заполнение
Процедура ЗаполнитьДанныеПоОснованию(ДанныеЗаполнения, Объект)   Экспорт
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Массив") Тогда
		мОснований= ДанныеЗаполнения;
	Иначе
		мОснований= Новый Массив();
		мОснований.Добавить(ДанныеЗаполнения);
	КонецЕсли;
	
	Для Каждого ЗаказНаДоставку Из мОснований Цикл  
		Если ЗначениеЗаполнено(ЗаказНаДоставку) Тогда
			Если Объект.РасчетДоставки.Количество() = 0 Тогда
				ЗаполнитьЗначенияСвойств(Объект, ЗаказНаДоставку,,"Дата,Номер,Проведен,Комментарий");
				
				Если ПустаяСтрока(Объект.Комментарий) Тогда
					Объект.Комментарий= ЗаказНаДоставку.Комментарий;
				КонецЕсли;
				
				Объект.Автор= Пользователи.ТекущийПользователь();
			КонецЕсли;
			
			ДобавитьВРасчетДоставки(ЗаказНаДоставку, Объект);
		КонецЕсли;
	КонецЦикла;
	
	Если Объект.ТранзитФизЛицо Тогда
		РасчитатьЗаложеноВСтоимость(Объект);
	КонецЕсли;	
	
	РассчитатьСтроки(Объект);
КонецПроцедуры
Процедура ДобавитьВРасчетДоставки(ЗаказНаДоставку, Объект) Экспорт
	//Удаляем строки если документ перевыбран
	мСтрок= Объект.РасчетДоставки.НайтиСтроки(Новый Структура("ЗаказНаДоставку", ЗаказНаДоставку));
	Для Каждого стрДок Из мСтрок Цикл
		Объект.РасчетДоставки.Удалить(стрДок);
	КонецЦикла;
	
	Для Каждого  стрОснование Из ЗаказНаДоставку.Основания Цикл  
		НоваяСтрока= Объект.РасчетДоставки.Добавить();
		НоваяСтрока.ЗаказНаДоставку= ЗаказНаДоставку;
		НоваяСтрока.ДокументОснование= стрОснование.Документ;
		НоваяСтрока.НомерДокументаОснования= стрОснование.Документ.Номер;
		
		//РассчитатьСтроку(НоваяСтрока.НомерСтроки-1, Объект);
	КонецЦикла;
	
	Объект.Вес= Объект. РасчетДоставки.Итог("Вес");
	Объект.Объем= Объект. РасчетДоставки.Итог("Объем");
КонецПроцедуры

Процедура РасчитатьЗаложеноВСтоимость(Объект) Экспорт
	Для Каждого стрРасчетДоставки Из Объект.РасчетДоставки Цикл  
		ЗаказНаДоставку= стрРасчетДоставки.ЗаказНаДоставку;
		Если ЗаказНаДоставку.ТранзитФизЛицо И Объект.СтавкаНДС = Перечисления.СтавкиНДС.БезНДС Тогда
			//Будет заполнятся при распределении
			//стрРасчетДоставки.ЗаложеноВСтоимостьБезНДС= ПолучитьСтоимостьУслугиДоставкиИЗДокументаПродажи(ЗаказНаДоставку);
			//стрРасчетДоставки.ЗаложеноВСтоимость= 0;
		Иначе
			//стрРасчетДоставки.ЗаложеноВСтоимостьБезНДС= ПолучитьСтоимостьУслугиДоставкиИЗДокументаПродажи(ЗаказНаДоставку);
			стрРасчетДоставки.ЗаложеноВСтоимость= ПолучитьСтоимостьТранспортныхИзПреобретения(ЗаказНаДоставку);
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры
Функция ПолучитьСтоимостьТранспортныхИзПреобретения(мЗаказовНаДоставку)
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗаказНаДоставкуОтПоставщикаОснования.Документ КАК Документ
	|ПОМЕСТИТЬ ВТ_ЗаказыНаДоставку
	|ИЗ
	|	Документ.ЗаказНаДоставкуОтПоставщика.Основания КАК ЗаказНаДоставкуОтПоставщикаОснования
	|ГДЕ
	|	ЗаказНаДоставкуОтПоставщикаОснования.Ссылка В(&мЗаказовНаДоставку)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПриобретениеТоваровУслуг.Ссылка КАК Поступление,
	|	ПриобретениеТоваровУслуг.ЗаказПоставщику КАК ЗаказПоставщику,
	|	ПриобретениеТоваровУслугТовары.Ссылка КАК ПриобретениеТранспортных,
	|	ПриобретениеТоваровУслугТовары.Номенклатура КАК Номенклатура,
	|	СУММА(ПриобретениеТоваровУслугТовары.СуммаСНДС) КАК СтоимостьТранспортныхСНДС
	|ПОМЕСТИТЬ ВТ
	|ИЗ
	|	Документ.ПриобретениеТоваровУслуг КАК ПриобретениеТоваровУслуг
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПриобретениеТоваровУслуг.Товары КАК ПриобретениеТоваровУслугТовары
	|		ПО ПриобретениеТоваровУслуг.Ссылка = ПриобретениеТоваровУслугТовары.АналитикаРасходов
	|ГДЕ
	|	ПриобретениеТоваровУслуг.Ссылка.ЗаказПоставщику В
	|			(ВЫБРАТЬ
	|				ВТ_ЗаказыНаДоставку.Документ КАК Документ
	|			ИЗ
	|				ВТ_ЗаказыНаДоставку КАК ВТ_ЗаказыНаДоставку)
	|	И ПриобретениеТоваровУслугТовары.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга) 
	|	И ПриобретениеТоваровУслуг.Проведен 
	|	И ПриобретениеТоваровУслугТовары.Ссылка.Проведен
	|
	|СГРУППИРОВАТЬ ПО
	|	ПриобретениеТоваровУслуг.Ссылка,
	|	ПриобретениеТоваровУслуг.ЗаказПоставщику,
	|	ПриобретениеТоваровУслугТовары.Ссылка,
	|	ПриобретениеТоваровУслугТовары.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СУММА(ВТ.СтоимостьТранспортныхСНДС) КАК СтоимостьТранспортныхСНДС
	|ИЗ
	|	ВТ КАК ВТ";
	
	Запрос.УстановитьПараметр("мЗаказовНаДоставку", мЗаказовНаДоставку);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.СтоимостьТранспортныхСНДС;
	КонецЦикла;
	
	Возврат 0;
КонецФункции
Функция ПолучитьСтоимостьУслугиДоставкиИЗДокументаПродажи(мЗаказовНаДоставку)
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗаказНаДоставкуОтПоставщикаОснования.Документ КАК Документ
	|ПОМЕСТИТЬ ВТ_ЗаказыНаДоставку
	|ИЗ
	|	Документ.ЗаказНаДоставкуОтПоставщика.Основания КАК ЗаказНаДоставкуОтПоставщикаОснования
	|ГДЕ
	|	ЗаказНаДоставкуОтПоставщикаОснования.Ссылка В(&мЗаказовНаДоставку)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗаказПоставщику.Ссылка КАК ЗаказПоставщику,
	|	ДокЗаказКлиента.Ссылка КАК ЗаказКлиента,
	|	ДокЗаказКлиента.РазмерТранспортных КАК РазмерТранспортных
	|ИЗ
	|	Документ.ЗаказПоставщику КАК ЗаказПоставщику
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказКлиента КАК ДокЗаказКлиента
	|		ПО ЗаказПоставщику.ДокументОснование = ДокЗаказКлиента.Ссылка
	|ГДЕ
	|	ЗаказПоставщику.Ссылка В
	|			(ВЫБРАТЬ
	|				ВТ_ЗаказыНаДоставку.Документ КАК Документ
	|			ИЗ
	|				ВТ_ЗаказыНаДоставку КАК ВТ_ЗаказыНаДоставку)";
	
	Запрос.УстановитьПараметр("мЗаказовНаДоставку", мЗаказовНаДоставку);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.РазмерТранспортных;
	КонецЦикла;
	
	Возврат 0;
КонецФункции


Процедура РассчитатьСтроки(Объект) Экспорт
	УстановитьПривилегированныйРежим(Истина);
	
	
	Для Каждого  ТекущаяСтрока Из Объект.РасчетДоставки Цикл
		РассчитатьСтроку(ТекущаяСтрока.НомерСтроки-1, Объект);
	КонецЦикла;
	
	РаспределитьФактическуюСтоимость(Объект);
	ВыполнитьРасчетТранспортных(Объект);
	
	УстановитьПривилегированныйРежим(Ложь);
КонецПроцедуры
Процедура РассчитатьСтроку(НомерСтроки, Объект) Экспорт
	ТекущаяСтрока= Объект.РасчетДоставки[НомерСтроки];
	
	ВесОбъем= Документы.ЗаказНаДоставкуОтПоставщика.ПолучитьИтогиПоДокументам(ТекущаяСтрока.ДокументОснование);
	ТекущаяСтрока.Вес= ВесОбъем.Вес;
	ТекущаяСтрока.Объем= ВесОбъем.Объем;
	ТекущаяСтрока.СтоимостьТовара= ВесОбъем.СтоимостьТовара;
КонецПроцедуры
Процедура РаспределитьФактическуюСтоимость(Объект) Экспорт
	ФактическаяСтоимость= Объект.ФактическаяСтоимостьДоставки;
	ВесИтого= Объект.РасчетДоставки.Итог("Вес");
	Если ФактическаяСтоимость <> 0 И ВесИтого <> 0 Тогда
		Коэф= ФактическаяСтоимость/ВесИтого;
		РаспределеннаяСтоимость= 0;
		Для Каждого  ТекущаяСтрока Из Объект.РасчетДоставки Цикл
			
			ТекущаяСтрока.РаспределенныеДеньгиНаДоставку= ТекущаяСтрока.Вес*Коэф;
			РаспределеннаяСтоимость= РаспределеннаяСтоимость+ТекущаяСтрока.РаспределенныеДеньгиНаДоставку;
		КонецЦикла;
		НеРаспределенныйОстаток=  ФактическаяСтоимость-РаспределеннаяСтоимость;
		ТекущаяСтрока.РаспределенныеДеньгиНаДоставку= ТекущаяСтрока.РаспределенныеДеньгиНаДоставку+НеРаспределенныйОстаток;
	Иначе
		Для Каждого  ТекущаяСтрока Из Объект.РасчетДоставки Цикл
			ТекущаяСтрока.РаспределенныеДеньгиНаДоставку= 0;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры
Процедура ВыполнитьРасчетТранспортных(Объект)
	//Константы
	ЭталонныйВес= Константы.ЭталонныйВес.Получить();
	
	//ТаблицаДля Расчета
	ОписаниеЧисла = Новый ОписаниеТипов("Число");
	ОписаниеСтроки = Новый ОписаниеТипов("Строка");
	ОписаниеДаты = Новый ОписаниеТипов("Дата");
	ОписаниеБулева = Новый ОписаниеТипов("Булево");	
	
	ТаблицаРасчета= Объект.РасчетДоставки.Выгрузить();
	ТаблицаРасчета.Колонки.Добавить("ОбъемныйВес", ОписаниеЧисла);
	ТаблицаРасчета.Колонки.Добавить("ПриведенныйВес", ОписаниеЧисла);
	ТаблицаРасчета.Колонки.Добавить("МинимальнаяСтоимость", ОписаниеЧисла);
	ТаблицаРасчета.Колонки.Добавить("КорректировкаТранспотныхПоМинЗначениям", ОписаниеЧисла);
	ТаблицаРасчета.Колонки.Добавить("КорректировкаТранспотных", ОписаниеЧисла);
	ТаблицаРасчета.Колонки.Добавить("РаспределениеТранспортныхПоПриведенномуВесу", ОписаниеЧисла);
	ТаблицаРасчета.Колонки.Добавить("ВремСуммаКРаспределению", ОписаниеЧисла);
	ТаблицаРасчета.Колонки.Добавить("ВремКоэф", ОписаниеЧисла);
	ТаблицаРасчета.Колонки.Добавить("ВремУменьшенСумма", ОписаниеЧисла);
	
	//РАСЧЕТ
	Для Каждого ТекущаяСтрока Из ТаблицаРасчета Цикл
		ТекущаяСтрока.ОбъемныйВес= ТекущаяСтрока.Объем*ЭталонныйВес;
		ТекущаяСтрока.ПриведенныйВес= Макс(ТекущаяСтрока.Вес, ТекущаяСтрока.ОбъемныйВес); 
		ТекущаяСтрока.МинимальнаяСтоимость= ТекущаяСтрока.ЗаказНаДоставку.СтоимостьДоставки;
	КонецЦикла;
	
	СуммаПриведенногоВеса= ТаблицаРасчета.Итог("ПриведенныйВес");
	Если СуммаПриведенногоВеса = 0 Тогда
		Сообщить("Не возможно расчитать вес товара!");
		Возврат;
	КонецЕсли;
	
	Для Каждого ТекущаяСтрока Из ТаблицаРасчета Цикл
		ТекущаяСтрока.РасчетнаяРекомендованнаяСтоимость=  Объект.ФактическаяСтоимостьДоставки*ТекущаяСтрока.ПриведенныйВес/СуммаПриведенногоВеса;
	КонецЦикла;
	
	//Копейки
	ТекущаяСтрока.РасчетнаяРекомендованнаяСтоимость= ТекущаяСтрока.РасчетнаяРекомендованнаяСтоимость+(Объект.ФактическаяСтоимостьДоставки-ТаблицаРасчета.Итог("РасчетнаяРекомендованнаяСтоимость"));
	
	//Вносим изменения
	Объект.РасчетДоставки.Загрузить(ТаблицаРасчета);
	//ТекстрРасчетДоставки= Объект.РасчетДоставки[ТекущаяСтрока.НомерСтроки-1];
	//ТекстрРасчетДоставки.РасчетнаяРекомендованнаяСтоимость= РасчетнаяРекомендованнаяСтоимость;
КонецПроцедуры

Функция ПолучитьИтоги(Объект) Экспорт
	Рез= Новый Структура("СуммаДокумента,Вес,Объем,СтоимостьДоставки,СтоимостьТовара,МаксимальнаяДлина,КоличествоМест",0,0,0,0,0,0,0);
	Запрос= Новый Запрос;
	Запрос.Текст= "ВЫБРАТЬ
	|	СУММА(ЗаказНаДоставкуОтПоставщика.Вес) КАК Вес,
	|	СУММА(ЗаказНаДоставкуОтПоставщика.Объем) КАК Объем,
	|	СУММА(ЗаказНаДоставкуОтПоставщика.СтоимостьДоставки) КАК СтоимостьДоставки,
	|	СУММА(ЗаказНаДоставкуОтПоставщика.СтоимостьТовара) КАК СтоимостьТовара,
	|	МАКСИМУМ(ЗаказНаДоставкуОтПоставщика.МаксимальнаяДлина) КАК МаксимальнаяДлина,
	|	СУММА(ЗаказНаДоставкуОтПоставщика.КоличествоМест) КАК КоличествоМест
	|ИЗ
	|	Документ.ЗаказНаДоставкуОтПоставщика КАК ЗаказНаДоставкуОтПоставщика
	|ГДЕ
	|	ЗаказНаДоставкуОтПоставщика.Ссылка В(&МассивЗаказов)";
	
	МассивЗаказов= Новый Массив;
	Для Каждого стрДок Из Объект.РасчетДоставки Цикл 
		МассивЗаказов.Добавить(стрДок.ЗаказНаДоставку);
	КонецЦикла;
	
	Запрос.УстановитьПараметр("МассивЗаказов", МассивЗаказов);
	Выборка= Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(Рез, Выборка);	
	КонецЦикла;
	
	Возврат Рез;
КонецФункции

#КонецОбласти

#Область Проверки
//Проведение
Процедура  КонтрольОстатков(Объект, Отказ)  Экспорт
	Если Объект.ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	РейсОтПоставщикаРасчетДоставки.ЗаказНаДоставку КАК ЗаказНаДоставку
	|ПОМЕСТИТЬ ВТ_Основания
	|ИЗ
	|	Документ.РейсОтПоставщика.РасчетДоставки КАК РейсОтПоставщикаРасчетДоставки
	|ГДЕ
	|	РейсОтПоставщикаРасчетДоставки.Ссылка = &Рейс
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЗаказыКДоставкеОтПоставщика.ЗаказНаДоставку КАК ЗаказНаДоставку,
	|	ЗаказыКДоставкеОтПоставщика.Регистратор КАК Рейс
	|ИЗ
	|	РегистрНакопления.ЗаказыКДоставкеОтПоставщика КАК ЗаказыКДоставкеОтПоставщика
	|ГДЕ
	|	ЗаказыКДоставкеОтПоставщика.ЗаказНаДоставку В
	|			(ВЫБРАТЬ
	|				ВТ_Основания.ЗаказНаДоставку КАК ЗаказНаДоставку
	|			ИЗ
	|				ВТ_Основания КАК ВТ_Основания)
	|	И ЗаказыКДоставкеОтПоставщика.Регистратор <> &Рейс
	|	И ЗаказыКДоставкеОтПоставщика.ВидДвижения = &ВидДвижения";
	
	Запрос.УстановитьПараметр("Рейс", Объект.Ссылка);
	Запрос.УстановитьПараметр("ВидДвижения", ВидДвиженияНакопления.Расход);
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда 
		Сообщить("Заказы на доставку присутствуют в других рейсах!");
		Отказ= Истина;
	КонецЕсли;
	
	Выборка= РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		АльтерраОбщегоНазначения.СообщитьПользователю(Выборка.Рейс, Строка(Выборка.ЗаказНаДоставку));
	КонецЦикла;
КонецПроцедуры

//Доп модуль отмена проведения
Процедура  ПроверитьЧтоНетРейсовИлиЗаказовНаДоставку(Объект, Отказ)  Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗаказыКДоставке.Регистратор КАК Регистратор
	|ИЗ
	|	РегистрНакопления.ЗаказыКДоставкеОтПоставщика КАК ЗаказыКДоставке
	|ГДЕ
	|	ЗаказыКДоставке.Документ = &Документ";
	
	Запрос.УстановитьПараметр("Документ", Объект.Ссылка);
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда 
		Сообщить("По документу существуют Заказы на доставку или Рейсы. Отмена проведения не возможна!");
	КонецЕсли;
	
	Выборка= РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		АльтерраОбщегоНазначения.СообщитьПользователю(Выборка.Регистратор, Строка(Выборка.Регистратор));
		Отказ= Истина;
	КонецЦикла;
КонецПроцедуры
#КонецОбласти

#Область Печать 
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт	
	//	
КонецПроцедуры

Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	//	
КонецПроцедуры
#КонецОбласти

#Область СозданиеНаОсновании
Функция ДобавитьКомандуСоздатьНаОсновании(КомандыСоздатьНаОсновании) Экспорт
	ИмяДокумента= "РейсОтПоставщика";
	Если ПравоДоступа("Добавление", Метаданные.Документы[ИмяДокумента]) Тогда
		КомандаСоздатьНаОсновании = КомандыСоздатьНаОсновании.Добавить();
		КомандаСоздатьНаОсновании.Менеджер = Метаданные.Документы[ИмяДокумента].ПолноеИмя();
		КомандаСоздатьНаОсновании.Представление = "Рейс от поставщика";
		КомандаСоздатьНаОсновании.РежимЗаписи = "Проводить";
		Возврат КомандаСоздатьНаОсновании;
	КонецЕсли;
	
	Возврат Неопределено;
КонецФункции
#КонецОбласти 

#Область Экспортные
Функция ПолучитьМассивЗаказовНаДоставку(Объект) Экспорт 
	ТЗЗаказов= Объект.РасчетДоставки.Выгрузить(,"ЗаказНаДоставку");
	ТЗЗаказов.Свернуть("ЗаказНаДоставку");
	
	Возврат ТЗЗаказов.ВыгрузитьКолонку("ЗаказНаДоставку");
КонецФункции
Функция ПолучитьДокументыПоЗаказу(Заказ) Экспорт
	мРеализаций= Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПоступлениеТоваровУслуг.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ПриобретениеТоваровУслуг КАК ПоступлениеТоваровУслуг
	|ГДЕ
	|	ПоступлениеТоваровУслуг.ЗаказПоставщику = &Заказ
	|	И ПоступлениеТоваровУслуг.Проведен
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПеремещениеТоваров.Ссылка
	|ИЗ
	|	Документ.ПеремещениеТоваров КАК ПеремещениеТоваров
	|ГДЕ
	|	ПеремещениеТоваров.ЗаказНаПеремещение = &Заказ
	|	И ПеремещениеТоваров.Проведен";
	
	Запрос.УстановитьПараметр("Заказ", Заказ);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		мРеализаций.Добавить(ВыборкаДетальныеЗаписи.Ссылка);
	КонецЦикла;
	
	Возврат мРеализаций;
	
КонецФункции
Функция ПолучитьДокументыКОформлениюПоступленияЗатрат(Перевозчик, ДатаОст) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	РейсОтПоставщикаРасчетДоставки.Ссылка КАК Рейс,
	|	ЗатратыПоДоставкеОтПоставщикаОстатки.Перевозчик КАК Перевозчик,
	|	ЗатратыПоДоставкеОтПоставщикаОстатки.Документ КАК Документ,
	|	РейсОтПоставщикаРасчетДоставки.ЗаказНаДоставку.АдресНаВыгрузке КАК АдресДоставки,
	|	ЗатратыПоДоставкеОтПоставщикаОстатки.СуммаОстаток КАК СуммаОстаток
	|ИЗ
	|	РегистрНакопления.ЗатратыПоДоставкеОтПоставщика.Остатки(&ДатаОст, Перевозчик = &Перевозчик) КАК ЗатратыПоДоставкеОтПоставщикаОстатки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РейсОтПоставщика.РасчетДоставки КАК РейсОтПоставщикаРасчетДоставки
	|		ПО ЗатратыПоДоставкеОтПоставщикаОстатки.Документ = РейсОтПоставщикаРасчетДоставки.ДокументОснование
	|ГДЕ
	|	НЕ РейсОтПоставщикаРасчетДоставки.Ссылка.ПометкаУдаления
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	РейсОтПоставщикаРасчетДоставки.Ссылка,
	|	ЗатратыПоДоставкеОтПоставщикаОстатки.Перевозчик,
	|	ЗатратыПоДоставкеОтПоставщикаОстатки.Документ,
	|	РейсОтПоставщикаРасчетДоставки.ЗаказНаДоставку.АдресНаВыгрузке,
	|	ЗатратыПоДоставкеОтПоставщикаОстатки.СуммаОстаток
	|ИЗ
	|	РегистрНакопления.ЗатратыПоДоставкеОтПоставщика.Остатки(&ДатаОст, Перевозчик = &Перевозчик) КАК ЗатратыПоДоставкеОтПоставщикаОстатки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказПоставщику КАК ЗаказПоставщику
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РейсОтПоставщика.РасчетДоставки КАК РейсОтПоставщикаРасчетДоставки
	|			ПО ЗаказПоставщику.Ссылка = РейсОтПоставщикаРасчетДоставки.ДокументОснование
	|		ПО ЗатратыПоДоставкеОтПоставщикаОстатки.Документ.ЗаказПоставщику = ЗаказПоставщику.Ссылка
	|ГДЕ
	|	НЕ РейсОтПоставщикаРасчетДоставки.Ссылка.ПометкаУдаления";
	
	Граница= Новый Граница(КонецДня(ДатаОст), ВидГраницы.Включая);
	Запрос.УстановитьПараметр("ДатаОст", Граница);
	Запрос.УстановитьПараметр("Перевозчик", Перевозчик);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса;
КонецФункции
Функция ДатаСтартаАктовПоРегистру()  Экспорт
	Возврат Дата(2018,10,01);
КонецФункции
Процедура ЗаполнитьИтоговуюСтоимость(Объект) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗатратыПоДоставкеОтПоставщика.Регистратор КАК Рейс,
	|	ЗатратыПоДоставкеОтПоставщика.Документ КАК Поступление,
	|	СУММА(ПоступлениеТоваровУслугТовары.СуммаСНДС) КАК ТранспортныеРасходы,
	|	ЗатратыПоДоставкеОтПоставщика.ДокументОснование КАК ДокументОснование
	|ИЗ
	|	РегистрНакопления.ЗатратыПоДоставкеОтПоставщика КАК ЗатратыПоДоставкеОтПоставщика
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПриобретениеТоваровУслуг.Товары КАК ПоступлениеТоваровУслугТовары
	|		ПО ЗатратыПоДоставкеОтПоставщика.Документ = ПоступлениеТоваровУслугТовары.АналитикаРасходов
	|ГДЕ
	|	ПоступлениеТоваровУслугТовары.Ссылка.Проведен = ИСТИНА
	|	И ПоступлениеТоваровУслугТовары.Ссылка.Партнер = &Партнер
	|	И ЗатратыПоДоставкеОтПоставщика.Регистратор = &Рейс
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗатратыПоДоставкеОтПоставщика.Регистратор,
	|	ЗатратыПоДоставкеОтПоставщика.Документ,
	|	ЗатратыПоДоставкеОтПоставщика.ДокументОснование";
	
	Запрос.УстановитьПараметр("Партнер", Справочники.Партнеры.НайтиПоКоду("А1633"));
	Запрос.УстановитьПараметр("Рейс", Объект.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		Отбор= Новый Структура("ДокументОснование", Выборка.ДокументОснование);
		Строки= Объект.РасчетДоставки.НайтиСтроки(Отбор);
		Для Каждого  НайденаяСтрока Из Строки Цикл
			НайденаяСтрока.ЗаложеноВСтоимость= Выборка.ТранспортныеРасходы;
		КонецЦикла;
	КонецЦикла;
КонецПроцедуры
Функция ПолучитьДокументыКОформлениюПоступленияЗатратПоРейсам(мРейсов) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РейсОтПоставщикаРасчетДоставки.Ссылка КАК Рейс,
	|	ЗатратыПоДоставкеОтПоставщика.Документ КАК Документ,
	|	РейсОтПоставщикаРасчетДоставки.ЗаказНаДоставку КАК ЗаказНаДоставку,
	|	СУММА(ЗатратыПоДоставкеОтПоставщика.Сумма) КАК СУММА,
	|	РейсОтПоставщикаРасчетДоставки.Ссылка.Перевозчик КАК Перевозчик,
	|	РейсОтПоставщикаРасчетДоставки.Ссылка.СтавкаНДС КАК СтавкаНДС
	|ИЗ
	|	Документ.РейсОтПоставщика.РасчетДоставки КАК РейсОтПоставщикаРасчетДоставки
	|		ПОЛНОЕ СОЕДИНЕНИЕ РегистрНакопления.ЗатратыПоДоставкеОтПоставщика КАК ЗатратыПоДоставкеОтПоставщика
	|		ПО (ЗатратыПоДоставкеОтПоставщика.Регистратор = РейсОтПоставщикаРасчетДоставки.Ссылка)
	|			И РейсОтПоставщикаРасчетДоставки.ДокументОснование = ЗатратыПоДоставкеОтПоставщика.ДокументОснование
	|ГДЕ
	|	РейсОтПоставщикаРасчетДоставки.Ссылка В(&мРейсов)
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗатратыПоДоставкеОтПоставщика.Документ,
	|	РейсОтПоставщикаРасчетДоставки.Ссылка,
	|	РейсОтПоставщикаРасчетДоставки.ЗаказНаДоставку,
	|	РейсОтПоставщикаРасчетДоставки.Ссылка.Перевозчик,
	|	РейсОтПоставщикаРасчетДоставки.Ссылка.СтавкаНДС";
	
	Запрос.УстановитьПараметр("мРейсов", мРейсов);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса;
КонецФункции
Функция СкорректироватьСуммуПоСтавкеНДС(Рейс, СуммаРасчета, СтавкаНДС) Экспорт
	СтавкаНДСПоУмолчанию= УчетНДСУП.СтавкаНДСПоУмолчанию(,Рейс.Дата);
	СтавкаНДСЧислом=СтавкаНДСПоУмолчанию.Ставка; 
	СуммаНДС= УчетНДСКлиентСервер.РассчитатьСуммуНДС(СуммаРасчета, Истина, СтавкаНДСЧислом);
	
	Если СтавкаНДС = Перечисления.СтавкиНДС.БезНДС Или НЕ ЗначениеЗаполнено(СтавкаНДС) Тогда
		НоваяСумма= СуммаРасчета-СуммаНДС;
	Иначе
		НоваяСумма= СуммаРасчета;
	КонецЕсли;
	
	Возврат НоваяСумма;
КонецФункции
Функция РеализацииПоРейсу(Рейс) Экспорт
	мРеализаций= Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РейсОтПоставщикаРасчетДоставки.Ссылка КАК Рейс,
	|	РейсОтПоставщикаРасчетДоставки.ЗаказНаДоставку КАК ЗаказНаДоставку,
	|	ДокЗаказПоставщику.Ссылка КАК ЗаказПоставщику,
	|	ДокЗаказКлиента.Ссылка КАК ЗаказКлиенту,
	|	РеализацияТоваровУслуг.Ссылка КАК Реализация
	|ИЗ
	|	Документ.РейсОтПоставщика.РасчетДоставки КАК РейсОтПоставщикаРасчетДоставки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказПоставщику КАК ДокЗаказПоставщику
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказКлиента КАК ДокЗаказКлиента
	|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|				ПО ДокЗаказКлиента.Ссылка = РеализацияТоваровУслуг.ЗаказКлиента
	|			ПО ДокЗаказПоставщику.ДокументОснование = ДокЗаказКлиента.Ссылка
	|		ПО РейсОтПоставщикаРасчетДоставки.ДокументОснование = ДокЗаказПоставщику.Ссылка
	|ГДЕ
	|	РейсОтПоставщикаРасчетДоставки.Ссылка = &Рейс";
	
	Запрос.УстановитьПараметр("Рейс", Рейс);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Возврат ВыборкаДетальныеЗаписи;
КонецФункции
Функция ПреобретенияДляРасчетаЗатрат(Рейс) Экспорт
	мРеализаций= Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РейсОтПоставщикаРасчетДоставки.Ссылка КАК Рейс,
	|	РейсОтПоставщикаРасчетДоставки.ЗаказНаДоставку КАК ЗаказНаДоставку,
	|	РейсОтПоставщикаРасчетДоставки.ДокументОснование КАК ДокументОснование,
	|	РейсОтПоставщикаРасчетДоставки.РаспределенныеДеньгиНаДоставку КАК РаспределенныеДеньгиНаДоставку
	|ПОМЕСТИТЬ ВТ_Оснований
	|ИЗ
	|	Документ.РейсОтПоставщика.РасчетДоставки КАК РейсОтПоставщикаРасчетДоставки
	|ГДЕ
	|	РейсОтПоставщикаРасчетДоставки.Ссылка = &Рейс
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Оснований.Рейс КАК Рейс,
	|	ВТ_Оснований.ЗаказНаДоставку КАК ЗаказНаДоставку,
	|	ПоступлениеТоваровУслуг.Ссылка КАК ДокументОснования,
	|	ВТ_Оснований.РаспределенныеДеньгиНаДоставку КАК РаспределенныеДеньгиНаДоставку,
	|	ПоступлениеТоваровУслуг.СуммаДокумента КАК СуммаДокумента,
	|	ПоступлениеТоваровУслуг.Подразделение КАК Подразделение,
	|	ПоступлениеТоваровУслуг.Склад КАК Склад
	|ИЗ
	|	ВТ_Оснований КАК ВТ_Оснований
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПриобретениеТоваровУслуг КАК ПоступлениеТоваровУслуг
	|		ПО ВТ_Оснований.ДокументОснование = ПоступлениеТоваровУслуг.Ссылка
	|ГДЕ
	|	ПоступлениеТоваровУслуг.Проведен
	|	И ВТ_Оснований.Рейс.ТранзитФизЛицо = ЛОЖЬ
	|	И ВТ_Оснований.ДокументОснование ССЫЛКА Документ.ПриобретениеТоваровУслуг
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_Оснований.Рейс,
	|	ВТ_Оснований.ЗаказНаДоставку,
	|	ПеремещениеТоваров.Ссылка,
	|	ВТ_Оснований.РаспределенныеДеньгиНаДоставку,
	|	0,
	|	ПеремещениеТоваров.Подразделение,
	|	ПеремещениеТоваров.СкладПолучатель
	|ИЗ
	|	ВТ_Оснований КАК ВТ_Оснований
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПеремещениеТоваров КАК ПеремещениеТоваров
	|		ПО ВТ_Оснований.ДокументОснование = ПеремещениеТоваров.Ссылка
	|ГДЕ
	|	ПеремещениеТоваров.Проведен
	|	И ВТ_Оснований.ДокументОснование ССЫЛКА Документ.ПеремещениеТоваров
	|	И ВТ_Оснований.Рейс.ТранзитФизЛицо = ЛОЖЬ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_Оснований.Рейс,
	|	ВТ_Оснований.ЗаказНаДоставку,
	|	ПоступлениеТоваровУслуг.Ссылка,
	|	ВТ_Оснований.РаспределенныеДеньгиНаДоставку,
	|	ПоступлениеТоваровУслуг.СуммаДокумента,
	|	ПоступлениеТоваровУслуг.Подразделение,
	|	ПоступлениеТоваровУслуг.Склад
	|ИЗ
	|	ВТ_Оснований КАК ВТ_Оснований
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПриобретениеТоваровУслуг КАК ПоступлениеТоваровУслуг
	|		ПО ВТ_Оснований.ДокументОснование = ПоступлениеТоваровУслуг.ЗаказПоставщику
	|ГДЕ
	|	ПоступлениеТоваровУслуг.Проведен
	|	И ВТ_Оснований.ДокументОснование ССЫЛКА Документ.ЗаказПоставщику
	|	И ВТ_Оснований.Рейс.ТранзитФизЛицо = ЛОЖЬ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_Оснований.Рейс,
	|	ВТ_Оснований.ЗаказНаДоставку,
	|	ПеремещениеТоваров.Ссылка,
	|	ВТ_Оснований.РаспределенныеДеньгиНаДоставку,
	|	0,
	|	ПеремещениеТоваров.Подразделение,
	|	ПеремещениеТоваров.СкладПолучатель
	|ИЗ
	|	ВТ_Оснований КАК ВТ_Оснований
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПеремещениеТоваров КАК ПеремещениеТоваров
	|		ПО ВТ_Оснований.ДокументОснование = ПеремещениеТоваров.ЗаказНаПеремещение
	|ГДЕ
	|	ПеремещениеТоваров.Проведен
	|	И ВТ_Оснований.ДокументОснование ССЫЛКА Документ.ЗаказНаПеремещение
	|	И ВТ_Оснований.Рейс.ТранзитФизЛицо = ЛОЖЬ
	|ИТОГИ
	|	СУММА(РаспределенныеДеньгиНаДоставку),
	|	СУММА(СуммаДокумента)
	|ПО
	|	ЗаказНаДоставку";
	
	Запрос.УстановитьПараметр("Рейс", Рейс);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "ЗаказНаДоставку");
	
	Возврат ВыборкаДетальныеЗаписи;
КонецФункции
Функция ВидТара() Экспорт
	ЗапросТара = Новый Запрос;
	ЗапросТара.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ВидыНоменклатуры.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ВидыНоменклатуры КАК ВидыНоменклатуры
	|ГДЕ
	|	ВидыНоменклатуры.Наименование = ""Тара""
	|	И НЕ ВидыНоменклатуры.ПометкаУдаления
	|	И ВидыНоменклатуры.ЭтоГруппа";
	
	РезультатЗапросаТара = ЗапросТара.Выполнить();
	ВыборкаТара = РезультатЗапросаТара.Выбрать();
	Пока ВыборкаТара.Следующий() Цикл
		Возврат ВыборкаТара.Ссылка;	
	КонецЦикла;   	
	Возврат Справочники.ВидыНоменклатуры.ПустаяСсылка();
КонецФункции   
Функция ПроверитьСостояниеОплатыРейса(Рейсы) Экспорт
	
	ВидТара = ВидТара();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	РейсОтПоставщикаРасчетДоставки.Ссылка КАК Рейс,
	               |	РейсОтПоставщикаРасчетДоставки.ДокументОснование КАК ДокументОснование,
	               |	РейсОтПоставщика.Дата КАК Дата,
	               |	ПриобретениеТоваровУслуг.Ссылка КАК Приобретение,
	               |	РейсОтПоставщикаРасчетДоставки.СостояниеОплаты КАК СостояниеОплатыИсходное,
	               |	ВЫБОР
	               |		КОГДА РейсОтПоставщикаРасчетДоставки.НаличиеАкта
	               |			ТОГДА 1
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК НаличиеАктаИсходное
	               |ПОМЕСТИТЬ ЗаказыПоставщикуКПроверке
	               |ИЗ
	               |	Документ.РейсОтПоставщика.РасчетДоставки КАК РейсОтПоставщикаРасчетДоставки
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РейсОтПоставщика КАК РейсОтПоставщика
	               |		ПО РейсОтПоставщикаРасчетДоставки.Ссылка = РейсОтПоставщика.Ссылка
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПриобретениеТоваровУслуг КАК ПриобретениеТоваровУслуг
	               |		ПО РейсОтПоставщикаРасчетДоставки.ДокументОснование = ПриобретениеТоваровУслуг.ЗаказПоставщику
	               |ГДЕ
	               |	РейсОтПоставщика.Проведен
	               |	И РейсОтПоставщика.Ссылка В(&Ссылка)
	               |	И ПриобретениеТоваровУслуг.Проведен
	               |	И РейсОтПоставщика.СостояниеОплатыШапка <> ЗНАЧЕНИЕ(Перечисление.СостояниеОплатыВРейсахОтПоставщика.ПустаяСсылка)
				   |	И РейсОтПоставщика.СостояниеОплатыШапка <> ЗНАЧЕНИЕ(Перечисление.СостояниеОплатыВРейсахОтПоставщика.ТранспортныеВРеализации)
	               |	И НЕ РейсОтПоставщика.СостояниеОплатыШапка = НЕОПРЕДЕЛЕНО
	               |	И НЕ РейсОтПоставщика.СостояниеОплатыШапка ЕСТЬ NULL
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ЗаказыПоставщикуКПроверке.Рейс КАК Рейс,
	               |	ЗаказыПоставщикуКПроверке.ДокументОснование КАК ДокументОснование,
	               |	ТоварыКПоступлениюОстатки.ДокументПоступления КАК ДокументПоступления,
	               |	ТоварыКПоступлениюОстатки.Номенклатура КАК Номенклатура,
	               |	ТоварыКПоступлениюОстатки.Характеристика КАК Характеристика,
	               |	ТоварыКПоступлениюОстатки.Назначение КАК Назначение,
	               |	ТоварыКПоступлениюОстатки.Склад КАК Склад,
	               |	ТоварыКПоступлениюОстатки.Отправитель КАК Отправитель,
	               |	ТоварыКПоступлениюОстатки.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	               |	ТоварыКПоступлениюОстатки.КОформлениюНакладныхПоРаспоряжениюОстаток КАК КОформлениюНакладныхПоРаспоряжениюОстаток,
	               |	ТоварыКПоступлениюОстатки.КОформлениюПоступленийПоРаспоряжениюОстаток КАК КОформлениюПоступленийПоРаспоряжениюОстаток,
	               |	ТоварыКПоступлениюОстатки.КОформлениюПоступленийПоНакладнымОстаток КАК КОформлениюПоступленийПоНакладнымОстаток,
	               |	ТоварыКПоступлениюОстатки.КОформлениюПоступленийПоОрдерамОстаток КАК КОформлениюПоступленийПоОрдерамОстаток,
	               |	ТоварыКПоступлениюОстатки.КОформлениюОрдеровОстаток КАК КОформлениюОрдеровОстаток,
	               |	ТоварыКПоступлениюОстатки.ПринимаетсяОстаток КАК ПринимаетсяОстаток,
	               |	ВЫБОР
	               |		КОГДА ТоварыКПоступлениюОстатки.ДокументПоступления ЕСТЬ NULL
	               |				ИЛИ ТоварыКПоступлениюОстатки.КОформлениюОрдеровОстаток < 0
	               |			ТОГДА 1
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК Статус,
	               |	ЗаказыПоставщикуКПроверке.Дата КАК Дата,
	               |	ЗаказыПоставщикуКПроверке.Приобретение КАК Приобретение,
	               |	ЗаказыПоставщикуКПроверке.СостояниеОплатыИсходное КАК СостояниеОплатыИсходное,
	               |	ЗаказыПоставщикуКПроверке.НаличиеАктаИсходное КАК НаличиеАктаИсходное
	               |ПОМЕСТИТЬ ЗаказыСоСтатусами
	               |ИЗ
	               |	ЗаказыПоставщикуКПроверке КАК ЗаказыПоставщикуКПроверке
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыКПоступлению.Остатки КАК ТоварыКПоступлениюОстатки
	               |		ПО (ЗаказыПоставщикуКПроверке.ДокументОснование = ТоварыКПоступлениюОстатки.ДокументПоступления
	               |				ИЛИ ЗаказыПоставщикуКПроверке.Приобретение = ТоварыКПоступлениюОстатки.ДокументПоступления)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ЗаказыСоСтатусами.ДокументОснование КАК ДокументОснование,
	               |	ЗаказыСоСтатусами.Рейс КАК Рейс,
	               |	ЗаказыСоСтатусами.Статус КАК Статус,
	               |	ЗаказыСоСтатусами.Дата КАК Дата,
	               |	ЗаказыСоСтатусами.Приобретение КАК Приобретение,
	               |	ЗаказыСоСтатусами.СостояниеОплатыИсходное КАК СостояниеОплатыИсходное,
	               |	ЗаказыСоСтатусами.НаличиеАктаИсходное КАК НаличиеАктаИсходное
	               |ПОМЕСТИТЬ ЗаказыБезРасхождений
	               |ИЗ
	               |	ЗаказыСоСтатусами КАК ЗаказыСоСтатусами
	               |ГДЕ
	               |	ЗаказыСоСтатусами.Статус = 1
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ЗаказыСоСтатусами.Рейс,
	               |	ЗаказыСоСтатусами.Статус,
	               |	ЗаказыСоСтатусами.Дата,
	               |	ЗаказыСоСтатусами.ДокументОснование,
	               |	ЗаказыСоСтатусами.Приобретение,
	               |	ЗаказыСоСтатусами.СостояниеОплатыИсходное,
	               |	ЗаказыСоСтатусами.НаличиеАктаИсходное
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ЗаказыБезРасхождений.ДокументОснование КАК ДокументОснование,
	               |	ЗаказыБезРасхождений.Рейс КАК Рейс,
	               |	ЗаказыБезРасхождений.Дата КАК Дата,
	               |	ЗаказыБезРасхождений.Приобретение КАК Приобретение,
	               |	КОЛИЧЕСТВО(ПриобретениеТоваровУслугТовары.НомерСтроки) КАК КоличествоСтрокВДокументе,
	               |	ЗаказыБезРасхождений.СостояниеОплатыИсходное КАК СостояниеОплатыИсходное,
	               |	ЗаказыБезРасхождений.НаличиеАктаИсходное КАК НаличиеАктаИсходное
	               |ПОМЕСТИТЬ КоличествоСтрокВПриобретении
	               |ИЗ
	               |	ЗаказыБезРасхождений КАК ЗаказыБезРасхождений
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПриобретениеТоваровУслуг.Товары КАК ПриобретениеТоваровУслугТовары
	               |		ПО ЗаказыБезРасхождений.Приобретение = ПриобретениеТоваровУслугТовары.Ссылка
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ЗаказыБезРасхождений.ДокументОснование,
	               |	ЗаказыБезРасхождений.Рейс,
	               |	ЗаказыБезРасхождений.Дата,
	               |	ЗаказыБезРасхождений.Приобретение,
	               |	ЗаказыБезРасхождений.СостояниеОплатыИсходное,
	               |	ЗаказыБезРасхождений.НаличиеАктаИсходное
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ЗаказыБезРасхождений.ДокументОснование КАК ДокументОснование,
	               |	ЗаказыБезРасхождений.Рейс КАК Рейс,
	               |	ЗаказыБезРасхождений.Дата КАК Дата,
	               |	ЗаказыБезРасхождений.Приобретение КАК Приобретение,
	               |	СУММА(ВЫБОР
	               |			КОГДА СправочникНоменклатура.ВидНоменклатуры ЕСТЬ NULL
	               |				ТОГДА 0
	               |			ИНАЧЕ 1
	               |		КОНЕЦ) КАК КоличествоСтрокТары,
	               |	КоличествоСтрокВПриобретении.КоличествоСтрокВДокументе КАК КоличествоСтрокВДокументе,
	               |	ЗаказыБезРасхождений.СостояниеОплатыИсходное КАК СостояниеОплатыИсходное,
	               |	ЗаказыБезРасхождений.НаличиеАктаИсходное КАК НаличиеАктаИсходное
	               |ПОМЕСТИТЬ КПроверкеТранспортных
	               |ИЗ
	               |	ЗаказыБезРасхождений КАК ЗаказыБезРасхождений
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПриобретениеТоваровУслуг.Товары КАК ПриобретениеТоваровУслугТовары
	               |			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СправочникНоменклатура
	               |			ПО ПриобретениеТоваровУслугТовары.Номенклатура = СправочникНоменклатура.Ссылка
	               |				И (СправочникНоменклатура.ВидНоменклатуры В ИЕРАРХИИ (&ВидНоменклатуры))
	               |		ПО ЗаказыБезРасхождений.Приобретение = ПриобретениеТоваровУслугТовары.Ссылка
	               |		ЛЕВОЕ СОЕДИНЕНИЕ КоличествоСтрокВПриобретении КАК КоличествоСтрокВПриобретении
	               |		ПО ЗаказыБезРасхождений.Приобретение = КоличествоСтрокВПриобретении.Приобретение
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ЗаказыБезРасхождений.ДокументОснование,
	               |	ЗаказыБезРасхождений.Рейс,
	               |	ЗаказыБезРасхождений.Дата,
	               |	ЗаказыБезРасхождений.Приобретение,
	               |	КоличествоСтрокВПриобретении.КоличествоСтрокВДокументе,
	               |	ЗаказыБезРасхождений.СостояниеОплатыИсходное,
	               |	ЗаказыБезРасхождений.НаличиеАктаИсходное
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	КПроверкеТранспортных.ДокументОснование КАК ДокументОснование,
	               |	КПроверкеТранспортных.Рейс КАК Рейс,
	               |	КПроверкеТранспортных.Приобретение КАК Приобретение,
	               |	ПриобретениеТранспортных.Ссылка КАК ПриобретениеТранспортных,
	               |	КПроверкеТранспортных.КоличествоСтрокТары КАК КоличествоСтрокТары,
	               |	КПроверкеТранспортных.КоличествоСтрокВДокументе КАК КоличествоСтрокВДокументе,
	               |	КПроверкеТранспортных.СостояниеОплатыИсходное КАК СостояниеОплатыИсходное,
	               |	КПроверкеТранспортных.НаличиеАктаИсходное КАК НаличиеАктаИсходное
	               |ПОМЕСТИТЬ ВТСТранспортными
	               |ИЗ
	               |	КПроверкеТранспортных КАК КПроверкеТранспортных
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПриобретениеТоваровУслуг.Товары КАК ПриобретениеТранспортных
	               |		ПО (ПриобретениеТранспортных.АналитикаРасходов = КПроверкеТранспортных.Приобретение)
	               |			И (ПриобретениеТранспортных.Ссылка.Проведен)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТСТранспортными.ДокументОснование КАК ЗаказПоставщику,
	               |	ВТСТранспортными.Рейс КАК Рейс,
	               |	ВТСТранспортными.Приобретение КАК Приобретение,
	               |	ВТСТранспортными.ПриобретениеТранспортных КАК ПриобретениеТранспортных,
	               |	ВЫБОР
	               |		КОГДА ВТСТранспортными.ПриобретениеТранспортных ЕСТЬ NULL
	               |			ТОГДА ВЫБОР
	               |					КОГДА ВТСТранспортными.КоличествоСтрокТары = ВТСТранспортными.КоличествоСтрокВДокументе
	               |						ТОГДА 1
	               |					ИНАЧЕ 0
	               |				КОНЕЦ
	               |		ИНАЧЕ 1
	               |	КОНЕЦ КАК Статус,
	               |	ВЫБОР
	               |		КОГДА ВТСТранспортными.СостояниеОплатыИсходное = ЗНАЧЕНИЕ(Перечисление.СостояниеОплатыВРейсахОтПоставщика.ГотовКОплате)
	               |			ТОГДА 1
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК СостояниеОплатыИсходное,
	               |	ВТСТранспортными.НаличиеАктаИсходное КАК НаличиеАктаИсходное
	               |ПОМЕСТИТЬ СтатусыПриобретений
	               |ИЗ
	               |	ВТСТранспортными КАК ВТСТранспортными
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ЗаказыСоСтатусами.ДокументОснование,
	               |	ЗаказыСоСтатусами.Рейс,
	               |	"""",
	               |	"""",
	               |	ЗаказыСоСтатусами.Статус,
	               |	0,
	               |	NULL
	               |ИЗ
	               |	ЗаказыСоСтатусами КАК ЗаказыСоСтатусами
	               |ГДЕ
	               |	ЗаказыСоСтатусами.Статус = 0
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	СтатусыПриобретений.ЗаказПоставщику КАК ЗаказПоставщику,
	               |	СтатусыПриобретений.Рейс КАК Рейс,
	               |	МИНИМУМ(СтатусыПриобретений.Статус) КАК СтатусКОплате,
	               |	СтатусыПриобретений.СостояниеОплатыИсходное КАК СостояниеОплатыИсходное,
	               |	ВЫБОР
	               |		КОГДА ТИПЗНАЧЕНИЯ(ЗапасыИПотребности.Регистратор) = ТИП(Документ.АктОРасхожденияхПослеПриемки)
	               |			ТОГДА 1
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК Акт,
	               |	ВЫБОР
	               |		КОГДА СтатусыПриобретений.НаличиеАктаИсходное ЕСТЬ NULL
	               |			ТОГДА 0
	               |		ИНАЧЕ СтатусыПриобретений.НаличиеАктаИсходное
	               |	КОНЕЦ КАК НаличиеАктаИсходное
	               |ПОМЕСТИТЬ ИтоговаяТаблицаСтатусов
	               |ИЗ
	               |	СтатусыПриобретений КАК СтатусыПриобретений
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ЗапасыИПотребности КАК ЗапасыИПотребности
	               |		ПО (ЗапасыИПотребности.Заказ = СтатусыПриобретений.ЗаказПоставщику)
	               |ГДЕ
	               |	ТИПЗНАЧЕНИЯ(ЗапасыИПотребности.Заказ) = ТИП(Документ.ЗаказПоставщику)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	СтатусыПриобретений.ЗаказПоставщику,
	               |	СтатусыПриобретений.Рейс,
	               |	СтатусыПриобретений.СостояниеОплатыИсходное,
	               |	ВЫБОР
	               |		КОГДА ТИПЗНАЧЕНИЯ(ЗапасыИПотребности.Регистратор) = ТИП(Документ.АктОРасхожденияхПослеПриемки)
	               |			ТОГДА 1
	               |		ИНАЧЕ 0
	               |	КОНЕЦ,
	               |	ВЫБОР
	               |		КОГДА СтатусыПриобретений.НаличиеАктаИсходное ЕСТЬ NULL
	               |			ТОГДА 0
	               |		ИНАЧЕ СтатусыПриобретений.НаличиеАктаИсходное
	               |	КОНЕЦ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ИтоговаяТаблицаСтатусов.ЗаказПоставщику КАК ЗаказПоставщику,
	               |	ИтоговаяТаблицаСтатусов.Рейс КАК Рейс,
	               |	ИтоговаяТаблицаСтатусов.СтатусКОплате КАК СтатусКОплате,
	               |	ИтоговаяТаблицаСтатусов.СостояниеОплатыИсходное КАК СостояниеОплатыИсходное,
	               |	ВЫБОР
	               |		КОГДА ИтоговаяТаблицаСтатусов.СтатусКОплате = ИтоговаяТаблицаСтатусов.СостояниеОплатыИсходное
	               |				И ИтоговаяТаблицаСтатусов.НаличиеАктаИсходное = МАКСИМУМ(ИтоговаяТаблицаСтатусов.Акт)
	               |			ТОГДА 0
	               |		ИНАЧЕ 1
	               |	КОНЕЦ КАК НужныИзменения,
	               |	МАКСИМУМ(ИтоговаяТаблицаСтатусов.Акт) КАК Акт
	               |ИЗ
	               |	ИтоговаяТаблицаСтатусов КАК ИтоговаяТаблицаСтатусов
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ИтоговаяТаблицаСтатусов.ЗаказПоставщику,
	               |	ИтоговаяТаблицаСтатусов.Рейс,
	               |	ИтоговаяТаблицаСтатусов.СтатусКОплате,
	               |	ИтоговаяТаблицаСтатусов.СостояниеОплатыИсходное,
	               |	ИтоговаяТаблицаСтатусов.НаличиеАктаИсходное";	
	
	    Запрос.УстановитьПараметр("ВидНоменклатуры", ВидТара);
      	Запрос.УстановитьПараметр("Ссылка", Рейсы);
		Результат = Запрос.Выполнить();
		ТаблицаСтатусов = Результат.Выгрузить();
		ТаблицаРейсов   = ТаблицаСтатусов.Скопировать();
		ТаблицаРейсов.Свернуть("Рейс", "НужныИзменения");
   		СтатусНеГотовКОплате = Перечисления.СостояниеОплатыВРейсахОтПоставщика.НеГотовКОплате;
		БылиИзменения = 0;
		Для Каждого РейсПоставщика из ТаблицаРейсов Цикл    
			Объект 		 		= РейсПоставщика.Рейс.ПолучитьОбъект();
	   	    ЕстьАкты	 		= 0;	  
		    ГотовКОплате 		= 0;
			БылиИзмененияСтрок 	= 0; 
			БылиИзмененияШапки 	= 0; 
			Если  РейсПоставщика.НужныИзменения > 0 Тогда
			   Для Каждого Строка из Объект.РасчетДоставки Цикл
					ИскомаяСтрока = ТаблицаСтатусов.Найти(Строка.ДокументОснование);
					Если ИскомаяСтрока <> Неопределено Тогда
						СтатусКОплате = ?(ИскомаяСтрока.СтатусКОплате = 0, "НеГотовКОплате", "ГотовКОплате");
						Если Строка.НаличиеАкта <> ИскомаяСтрока.Акт Тогда
							Строка.НаличиеАкта = ИскомаяСтрока.Акт
						КонецЕсли; 
						Если Строка.СостояниеОплаты <> Перечисления.СостояниеОплатыВРейсахОтПоставщика[СтатусКОплате] Тогда
							Строка.СостояниеОплаты = Перечисления.СостояниеОплатыВРейсахОтПоставщика[СтатусКОплате];
						КонецЕсли;
					ИначеЕсли Строка.СостояниеОплаты <> СтатусНеГотовКОплате Тогда
						Строка.СостояниеОплаты = СтатусНеГотовКОплате;
					КонецЕсли;	
				КонецЦикла; 
				БылиИзмененияСтрок = 1;
			КонецЕсли; 
	 		Для Каждого Строка из Объект.РасчетДоставки Цикл
				Если Строка.СостояниеОплаты = Перечисления.СостояниеОплатыВРейсахОтПоставщика.ГотовКОплате Тогда
				  ГотовКОплате = ГотовКОплате + 1; 
			  	КонецЕсли;    
			  	Если Строка.НаличиеАкта Тогда
					ЕстьАкты = 1;
				КонецЕсли;	
			КонецЦикла;
			КоличествоСтрок = Объект.РасчетДоставки.Количество();
			Если ГотовКОплате > 0 И КоличествоСтрок = ГотовКОплате Тогда
				Если ЕстьАкты Тогда
					НовоеСостояниеОплатыШапка = Перечисления.СостояниеОплатыВРейсахОтПоставщика.ГотовКОплатеСАктом;
				Иначе
					НовоеСостояниеОплатыШапка = Перечисления.СостояниеОплатыВРейсахОтПоставщика.ГотовКОплате;
				КонецЕсли;
			ИначеЕсли ГотовКОплате = 0 Тогда
				НовоеСостояниеОплатыШапка = Перечисления.СостояниеОплатыВРейсахОтПоставщика.НеГотовКОплате;
			Иначе
				НовоеСостояниеОплатыШапка = Перечисления.СостояниеОплатыВРейсахОтПоставщика.ЧастичноГотовКОплате;
			КонецЕсли;
			Если Объект.СостояниеОплатыШапка <> НовоеСостояниеОплатыШапка Тогда
				Объект.СостояниеОплатыШапка = НовоеСостояниеОплатыШапка;
				БылиИзмененияШапки = 1;
			КонецЕсли;	 
			Если БылиИзмененияСтрок ИЛИ БылиИзмененияШапки Тогда
				Если БылиИзмененияСтрок Тогда
					РасчитатьЗаложеноВСтоимость(Объект);
				КонецЕсли;	
				Объект.Записать(); 
				БылиИзменения = 1;
			КонецЕсли;	
		КонецЦикла;	
		Возврат БылиИзменения;
КонецФункции
Функция ПолучитьНастройкиОбработкиРаспределения() Экспорт

	ВнешнийОтчетОбработкаСсылка =  НайтиВнешнююОбработкуРаспределения();
	НастройкиХранилища = ВнешнийОтчетОбработкаСсылка.ХранилищеНастроек.Получить();
	Если НастройкиХранилища	<> Неопределено Тогда   
		ДатаЗапускаАвтоматическогоРаспределения = НастройкиХранилища.ДатаНачалаАвтораспределенияТранспортных;
	Иначе
		ОписаниеОшибки = "Не найдены настройки даты начала автоматического распределения транспортных расходов ";
		ЗаписьЖурналаРегистрации("АвтоформированиеТранспортныхРасходов", УровеньЖурналаРегистрации.Ошибка, , , ОписаниеОшибки);
		ДатаЗапускаАвтоматическогоРаспределения = Дата(1, 1, 1);
	КонецЕсли;	
	Возврат ДатаЗапускаАвтоматическогоРаспределения;
КонецФункции	
Функция НайтиВнешнююОбработкуРаспределения() Экспорт
	Возврат Справочники.ДополнительныеОтчетыИОбработки.НайтиПоНаименованию("Автоматическое распределение транспортных расходов");
КонецФункции	


#КонецОбласти

#Область Транзит
Процедура ОтгрузитьТранзитныйЗаказНаСервере(Объект, БезНДС, Отказ=Ложь) Экспорт
	стрДокументы= ЗапросКДокументам(Объект);
	ЗаказКлиента= стрДокументы.ЗаказКлиента;
	ЗаказПоставщику= стрДокументы.ЗаказПоставщику;
	ЗаказНаДоставку= стрДокументы.ЗаказНаДоставку;
	НомерСтрокиЗаказНаДоставку= стрДокументы.НомерСтроки;
	
	Если ЗаказКлиента = Неопределено Тогда
		Сообщить("Ошибка: Нет заказ клиента по транзит физ.лицу");
		Возврат;
	КонецЕсли;
	Если ЗаказПоставщику = Неопределено Тогда
		Сообщить("Ошибка: Нет созданных заказов поставщику");
		Возврат;
	КонецЕсли;
	
	ТЗТоварЗаказ= ЗаказКлиента.Товары.Выгрузить();
	МассивТипов= Новый Массив;
	МассивТипов.Добавить(Тип("Булево"));
	ТЗТоварЗаказ.Колонки.Добавить("РаспределятьУслугу", Новый ОписаниеТипов(МассивТипов));
	ТЗТоварКРаспределению= ЗаказКлиента.Товары.Выгрузить().СкопироватьКолонки();
	КодСтроки= ПолучитьМаксимальныйКодСтроки(ЗаказКлиента);

	Для Каждого стрЗаказПоставщика Из ЗаказПоставщику.Товары Цикл
		Если стрЗаказПоставщика.Отменено Тогда
			Продолжить;
		КонецЕсли;
		
		Отбор= Новый Структура("Номенклатура, Характеристика, Отменено, ВариантОбеспечения", стрЗаказПоставщика.Номенклатура, стрЗаказПоставщика.Характеристика, стрЗаказПоставщика.Отменено, Перечисления.ВариантыОбеспечения.КОбеспечению);
		СтрокиЗаказа= ТЗТоварЗаказ.НайтиСтроки(Отбор);
		
		КолПривезли= стрЗаказПоставщика.КоличествоУпаковок;
		Для Каждого стрЗаказа Из СтрокиЗаказа Цикл
			Если стрЗаказа.КоличествоУпаковок = КолПривезли Тогда
				//Отгружаем всю строку
				Если ЗначениеЗаполнено(стрЗаказПоставщика.Назначение) Тогда
					стрЗаказа.ВариантОбеспечения= Перечисления.ВариантыОбеспечения.КОбеспечению;
				Иначе
					стрЗаказа.ВариантОбеспечения= Перечисления.ВариантыОбеспечения.Отгрузить;
				КонецЕсли;
				стрЗаказа.РаспределятьУслугу= Истина;
				КолПривезли= 0;
			ИначеЕсли стрЗаказа.КоличествоУпаковок > КолПривезли Тогда
				//Разбиваем строку
				стрЗаказа.КоличествоУпаковок= стрЗаказа.КоличествоУпаковок-КолПривезли;
				стрЗаказа.Количество= стрЗаказа.КоличествоУпаковок;
				АльтерраОбщегоНазначения.ПересчитатьСуммыВСтрокеТовара(ЗаказКлиента, стрЗаказа);
				
				//Добавляем
				НоваяСтрока= ТЗТоварЗаказ.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, стрЗаказа);
				НоваяСтрока.КоличествоУпаковок= КолПривезли;
				НоваяСтрока.Количество= КолПривезли;
				АльтерраОбщегоНазначения.ПересчитатьСуммыВСтрокеТовара(ЗаказКлиента, НоваяСтрока);
				КодСтроки= КодСтроки+1;
				НоваяСтрока.КодСтроки= КодСтроки;
				Если ЗначениеЗаполнено(стрЗаказПоставщика.Назначение) Тогда
					НоваяСтрока.ВариантОбеспечения= Перечисления.ВариантыОбеспечения.Отгрузить;
					НоваяСтрока.Обособленно = Истина;
				Иначе
					НоваяСтрока.ВариантОбеспечения= Перечисления.ВариантыОбеспечения.Отгрузить;
				КонецЕсли;
				НоваяСтрока.РаспределятьУслугу= Истина;
				КолПривезли= 0;
			Иначе
				//Отгружаем не всю
				Если НЕ ЗначениеЗаполнено(стрЗаказПоставщика.Назначение) Тогда
					стрЗаказа.ВариантОбеспечения= Перечисления.ВариантыОбеспечения.Отгрузить;
					НоваяСтрока.Обособленно = Истина;
				Иначе
					стрЗаказа.ВариантОбеспечения= Перечисления.ВариантыОбеспечения.Отгрузить;
				КонецЕсли;
				стрЗаказа.РаспределятьУслугу= Истина;
				КолПривезли= КолПривезли-стрЗаказа.КоличествоУпаковок;
			КонецЕсли;
		КонецЦикла;
		Если КолПривезли > 0 Тогда 				
			Сообщить("Ошибка: Недостаточно количества в заказе клиента");
			Отказ= Истина;
		КонецЕсли;
	КонецЦикла;
	
	//РаспределениеТранспортных
	Если БезНДС Тогда
		Если Не БылоРаспределение(ЗаказКлиента) Тогда
			ДополнительнаяСтоимостьДоставки= ПолучитьСуммуУслугиДоставки(ТЗТоварЗаказ);
		Иначе
			ДополнительнаяСтоимостьДоставки= 0;
		КонецЕсли;
		
		РазмерТранспортных= ПолучитьРазмерТранспортных(ЗаказКлиента);
		
		СтрокиКРаспределению= ТЗТоварЗаказ.НайтиСтроки(Новый Структура("РаспределятьУслугу", Истина));
		
		МассивСумм= Новый Массив;
		Для Каждого стрТовар Из СтрокиКРаспределению Цикл
			МассивСумм.Добавить(стрТовар.Сумма);
		КонецЦикла;	
		
		РазмерТранспортных= ПолучитьРазмерТранспортных(ЗаказКлиента);
		МассивРаспределения = ОбщегоНазначения.РаспределитьСуммуПропорциональноКоэффициентам(РазмерТранспортных, МассивСумм);
		Если МассивРаспределения = Неопределено Тогда
			Отказ= Истина;
			Сообщить("Ошибка: Нет данных к распределению");
			Возврат;
		КонецЕсли; 
		
		Индекс = 0;
		Для Каждого СтрокаТабличнойЧасти Из СтрокиКРаспределению Цикл
			СтрокаТабличнойЧасти.Сумма = СтрокаТабличнойЧасти.Сумма - МассивРаспределения[Индекс];
			АльтерраОбщегоНазначения.ПересчитатьЦеныВСтрокеТовара(ЗаказКлиента, СтрокаТабличнойЧасти);
			Индекс = Индекс + 1;			
		КонецЦикла;
		
		ЗаменитьУслугуВДокументе(ЗаказКлиента, ТЗТоварЗаказ);
		ДобавитьУслугуВДокумент(ЗаказКлиента, ТЗТоварЗаказ, РазмерТранспортных, 1);
		
		//Заполняем заложено в стоимость
		стрРасчетДоставки= Объект.РасчетДоставки[НомерСтрокиЗаказНаДоставку-1];
		стрРасчетДоставки.ЗаложеноВСтоимостьБезНДС= РазмерТранспортных+ДополнительнаяСтоимостьДоставки;
	Иначе
		//Ситуация когда небыло не одной Без НДС-ной доставки и доставка с НДС и она последняя. Добавляем услугу.
		//Убираю услуга уже есть, т.е. пока ничего не делаем
		
		//СтрокиНеРаспределено= ЗаказКлиента.РаспределениеТранспортныхРасходов.НайтиСтроки(Новый Структура("Распределено", Ложь));
		//Если СтрокиНеРаспределено = 1 И ЗаказКлиента.ДополнительнаяСтоимостьДоставки > 0 Тогда
		//	ДополнительнаяСтоимостьДоставкиРаспределено= СуммаДополнительнойСтоимостиОтгружено(ЗаказКлиента);
		//	Если ДополнительнаяСтоимостьДоставкиРаспределено < ЗаказКлиента.ДополнительнаяСтоимостьДоставки Тогда
		//		ДополнительнаяСтоимостьДоставки= ЗаказКлиента.ДополнительнаяСтоимостьДоставки;
		//		ДобавитьУслугуВДокумент(ЗаказКлиента, ТЗТоварЗаказ, ДополнительнаяСтоимостьДоставки, 1);
		//	КонецЕсли;
		//КонецЕсли;
	КонецЕсли;

	//Записываем заказ
	Если Не Отказ Тогда
		Если ТЗТоварЗаказ.Итог("Сумма") = ЗаказКлиента.Товары.Итог("Сумма") Тогда
			ЗаказКлиентаОбъект= ЗаказКлиента.ПолучитьОбъект();
			ЗаказКлиентаОбъект.Товары.Загрузить(ТЗТоварЗаказ);
			
			ПоставитьОтметкуВРаспределениеТранспортныхРасходов(ЗаказКлиентаОбъект);
			
			ЗаказКлиентаОбъект.Записать(РежимЗаписиДокумента.Проведение);
			
			ОбщегоНазначения.СообщитьПользователю("Записан: "+ЗаказКлиента, ЗаказКлиента);
		Иначе
			Отказ= Истина;
			Сообщить("Ошибка: Сумма заказа изменилась");
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

//Вспомогательные             
Функция ПолучитьСтрокуДокументовОснований(ДокументОснование, Номер) Экспорт
	Если ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.ПриобретениеТоваровУслуг") Тогда
		Возврат ДокументОснование.Номер;
	КонецЕсли;
	
	Если ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.ЗаказПоставщику") ИЛИ ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.ЗаказНаПеремещение") Тогда
		мДок= ПолучитьДокументыПоЗаказу(ДокументОснование);
		Если мДок.Количество() > 0 Тогда
			стрДокументы="";
			Для Каждого Док Из мДок Цикл
				стрДокументы=стрДокументы+Док.Номер+"  ";
			КонецЦикла;
		Иначе
			Возврат Номер;
		КонецЕсли;
	КонецЕсли;
	
	Возврат стрДокументы;
КонецФункции
Функция ЗапросКДокументам(Объект)
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗаказНаДоставкуОтПоставщикаОснования.Документ КАК Документ,
	|	ЗаказНаДоставкуОтПоставщикаОснования.Ссылка КАК ЗаказНаДоставку,
	|	ЗаказНаДоставкуОтПоставщикаОснования.НомерСтроки КАК НомерСтроки
	|ПОМЕСТИТЬ ВТ_ЗаказыНаДоставку
	|ИЗ
	|	Документ.ЗаказНаДоставкуОтПоставщика.Основания КАК ЗаказНаДоставкуОтПоставщикаОснования
	|ГДЕ
	|	ЗаказНаДоставкуОтПоставщикаОснования.Ссылка В(&мЗаказовНаДоставку)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗаказПоставщику.Ссылка КАК ЗаказПоставщику,
	|	ДокЗаказКлиента.Ссылка КАК ЗаказКлиента,
	|	ВТ_ЗаказыНаДоставку.ЗаказНаДоставку КАК ЗаказНаДоставку,
	|	ВТ_ЗаказыНаДоставку.НомерСтроки КАК НомерСтроки
	|ИЗ
	|	ВТ_ЗаказыНаДоставку КАК ВТ_ЗаказыНаДоставку
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказПоставщику КАК ЗаказПоставщику
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказКлиента КАК ДокЗаказКлиента
	|			ПО ЗаказПоставщику.ДокументОснование = ДокЗаказКлиента.Ссылка
	|		ПО ВТ_ЗаказыНаДоставку.Документ = ЗаказПоставщику.Ссылка
	|ГДЕ
	|	ДокЗаказКлиента.ТранзитФизЛицо";
	
	мЗаказов= Новый Массив;
	Для Каждого стрДокумент Из Объект.РасчетДоставки Цикл 
		Если стрДокумент.ЗаказНаДоставку.ТранзитФизЛицо Тогда
			мЗаказов.Добавить(стрДокумент.ЗаказНаДоставку);
		КонецЕсли;
	КонецЦикла;
	
	Запрос.УстановитьПараметр("мЗаказовНаДоставку", мЗаказов);
	
	Результат = Запрос.Выполнить();
	
	Рез= Новый Структура("ЗаказКлиента,ЗаказПоставщику,ЗаказНаДоставку,НомерСтроки", Неопределено, Неопределено, Неопределено, -1);
	
	Выборка= Результат.Выбрать();
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(Рез, Выборка);
	КонецЕсли;
	
	Возврат Рез;
КонецФункции
Функция ПолучитьМаксимальныйКодСтроки(ЗаказКлиента)
	ТЗ= ЗаказКлиента.Товары.Выгрузить();
	ТЗ.Сортировать("КодСтроки УБЫВ");
	
	Возврат ТЗ[0].КодСтроки;
КонецФункции
Функция ПолучитьРазмерТранспортных(ЗаказКлиента)
	СтрокиНеРаспределено= ЗаказКлиента.РаспределениеТранспортныхРасходов.НайтиСтроки(Новый Структура("Распределено", Ложь));
	Если СтрокиНеРаспределено.Количество() = 0 Тогда
		Возврат 0;
	КонецЕсли;
	
	Возврат СтрокиНеРаспределено[0].Сумма;
КонецФункции
Функция БылоРаспределение(ЗаказКлиента) Экспорт
	СтрокиРаспределено= ЗаказКлиента.РаспределениеТранспортныхРасходов.НайтиСтроки(Новый Структура("Распределено", Истина));
	
	Возврат (СтрокиРаспределено.Количество() > 0);
КонецФункции
Процедура ДобавитьУслугуВДокумент(ЗаказКлиента, Товары, Количество, Цена)
	НоваяСтрока= Товары.Добавить();
	НоваяСтрока.Номенклатура = АльтерраОбщегоНазначения.УслугаДоставкиБезНДС();
	НоваяСтрока.Количество= Количество; 
	НоваяСтрока.Цена= Цена; 
	НоваяСтрока.КоличествоУпаковок= НоваяСтрока.Количество;
	НоваяСтрока.СтавкаНДС= НоваяСтрока.Номенклатура.СтавкаНДС;
	НоваяСтрока.ВариантОбеспечения= Перечисления.ВариантыОбеспечения.Отгрузить;
	НоваяСтрока.Склад= ЗаказКлиента.Склад;
	
	КодСтроки= ПолучитьМаксимальныйКодСтроки(ЗаказКлиента);
	НоваяСтрока.КодСтроки= КодСтроки+1;

	АльтерраОбщегоНазначения.ПересчитатьСуммыВСтрокеТовара(ЗаказКлиента, НоваяСтрока);
КонецПроцедуры
Процедура ЗаменитьУслугуВДокументе(ЗаказКлиента, Товары)
	УслугаСНДС=АльтерраОбщегоНазначения.УслугаДоставкиСНДС();
	
	Строки= Товары.НайтиСтроки(Новый Структура("Номенклатура", УслугаСНДС));
	Для Каждого НоваяСтрока Из Строки Цикл
		НоваяСтрока.Номенклатура= АльтерраОбщегоНазначения.УслугаДоставкиБезНДС();
		НоваяСтрока.СтавкаНДС= НоваяСтрока.Номенклатура.СтавкаНДС;
		НоваяСтрока.ВариантОбеспечения= Перечисления.ВариантыОбеспечения.Отгрузить;
		
		АльтерраОбщегоНазначения.ПересчитатьСуммыВСтрокеТовара(ЗаказКлиента, НоваяСтрока);
	КонецЦикла;
КонецПроцедуры
Процедура ПоставитьОтметкуВРаспределениеТранспортныхРасходов(ЗаказКлиентаОбъект)
	СтрокиНеРаспределено= ЗаказКлиентаОбъект.РаспределениеТранспортныхРасходов.НайтиСтроки(Новый Структура("Распределено", Ложь));
	Если СтрокиНеРаспределено.Количество() > 0 Тогда
		СтрокиНеРаспределено[0].Распределено= Истина;
	Иначе
		Сообщить("Ошибка: Уже все суммы распределены");
	КонецЕсли;
КонецПроцедуры
Функция ПолучитьСуммуУслугиДоставки(ТЗТовары)
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТЗТовары.Сумма КАК Сумма,
	|	ТЗТовары.Номенклатура КАК Номенклатура
	|ПОМЕСТИТЬ ВТ
	|ИЗ
	|	&ТЗТовары КАК ТЗТовары
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ.Сумма КАК Сумма,
	|	ВТ.Номенклатура КАК Номенклатура
	|ИЗ
	|	ВТ КАК ВТ
	|ГДЕ
	|	ВТ.Номенклатура В ИЕРАРХИИ(&ГруппаУслуг)";
	
	Запрос.УстановитьПараметр("ТЗТовары", ТЗТовары);
	Запрос.УстановитьПараметр("ГруппаУслуг", АльтерраОбщегоНазначения.ПолучитьГруппуУслугДоставкиСНДС());
	
	РезультатЗапроса = Запрос.Выполнить();
	ТЗ= РезультатЗапроса.Выгрузить();
	Если ТЗ.Количество() > 0 Тогда	
		Возврат ТЗ.Итог("Сумма");
	КонецЕсли;	
	
	Возврат 0;
КонецФункции
#КонецОбласти
#КонецЕсли
